gw/ctcc/ISMP/IsmpSpEngineSoapBinding.serviceConsumeNotify.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://req.sp.ismp.chinatelecom.com"
  xmlns:ns3="http://rsp.sp.ismp.chinatelecom.com"
  xmlns:ns1="http://sp.ismp.chinatelecom.com">
 <SOAP-ENV:Body>
   <ns1:serviceConsumeNotifyReqPara>
    <ns2:featureStr></ns2:featureStr>
    <ns2:linkID></ns2:linkID>
    <ns2:productID></ns2:productID>
    <ns2:streamingNo></ns2:streamingNo>
    <ns2:userID></ns2:userID>
    <ns2:userIDType>0</ns2:userIDType>
   </ns1:serviceConsumeNotifyReqPara>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
